import pandas as pd
from datetime import date

# беремо словник який був у мене в пр5

students = {
    "Щербань Дарія Миколаївна": (2006, 3, 30),
    "Бачиш Павло Геннадійович": (2007, 10, 21),
    "Козинець Володимир Андрійович": (2007, 6, 10),
    "Гиренко Ілля Романович": (2006, 11, 2),
    "Сагайдак Богдан Андрійович": (2007, 9, 13),
    "Мартиненко Олександр Володимирович": (2006, 5, 24),
    "Репін Данііл Вікторович": (2006, 7, 25),
    "Голишев Артем Антонович": (2007, 6, 30),
    "Шкурат Дар`я Андріївна": (2007, 11, 2),
    "Біла Єлизавета Сергіївна": (2007, 6, 11),
}

# додаємо числові характеристики, а саме оцінка з матем. та сер.оцінка
extra_data = {
    "Щербань Дарія Миколаївна": (10, 9.5),
    "Бачиш Павло Геннадійович": (8, 8.0),
    "Козинець Володимир Андрійович": (11, 9.8),
    "Гиренко Ілля Романович": (7, 7.5),
    "Сагайдак Богдан Андрійович": (9, 8.7),
    "Мартиненко Олександр Володимирович": (12, 11.2),
    "Репін Данііл Вікторович": (6, 6.9),
    "Голишев Артем Антонович": (9, 8.9),
    "Шкурат Дар`я Андріївна": (10, 9.0),
    "Біла Єлизавета Сергіївна": (11, 10.0),
}

df = pd.DataFrame([
    {
        "ПІБ": name,
        "Рік": data[0],
        "Місяць": data[1],
        "День": data[2],
        "Оцінка_з_матем.": extra_data[name][0],
        "Сер._бал": extra_data[name][1]
    }
    for name, data in students.items()
])

print("\nДатафрейм:")
print(df)

# виконаємо базовий аналіз

print("\nПерші 3 рядки датафрейму")
print(df.head(3))

print("\nТипи даних")
print(df.dtypes)

print("\nПеревірка коректності") # перевіримо дані після конвертації
correct_types = {
    "ПІБ": object,
    "Рік": int,
    "Місяць": int,
    "День": int,
    "Оцінка_з_матем.": int,
    "Сер._бал": float
}

for col in df.columns:
    is_correct = df[col].dtype == correct_types[col]
    print(f"Стовпець '{col}': тип = {df[col].dtype}, коректно? {is_correct}")


print("\nРозмір датафрейму")
print(df.shape)

expected_shape = (len(students), 6) # перевіримо розмірність після конвертації
print(f"Чи форма правильна? {df.shape == expected_shape}")


print("\nОписова статистика")
print(df.describe())

current_year = date.today().year # додамо новий стовпець для подальших дій, а саме вік учня
df["Вік"] = current_year - df["Рік"] # автоматично обчислюємо

print("\nДатафрейм після додавання стовпця Вік")
print(df)

filtered = df[df["Вік"] > 18] # фільтрація, як приклад учні яким більше 18 років

print("\nУчні старші за 18 років")
print(filtered)

sorted_df = df.sort_values(by="Сер._бал", ascending=False) # сортування, як пр. спадання сер.бала

print("\nСпадне сортування за середнім балом")
print(sorted_df)

grouped = df.groupby("Рік")["Сер._бал"].mean() # групування для знах. сер.балу за кожним роком нар.

print("\nСередній бал за роком народження")
print(grouped)

# дод. агрегації

print("\nНайвища оцінка з математики")
print(df["Оцінка_з_матем."].max())

print("\nКількість унікальних років народження")
print(df["Рік"].nunique())

print("\nМаксимальний середній бал у категорії року народження")
print(df.groupby("Рік")["Сер._бал"].max())
